Q5/CalculNumeric/Apunts/Tema4.org
* Integracio Numerica

** Metodes
   
*** Simple o Composta

*** Segon les dades
**** Newton-Cotes: els punts estan fixats
**** Gauss: Podem avaluar la funcio en un punt
*** Oberta o tancada

** Ordre d'una quadratura
Una quadratura es d'ordre q, si integra exactament un polinomi de grau q. (per exemple si l'error depen de la derivada q+1-essima)

** Quadratura: Newton-Cotes 
Fixats els punts \( \{x_{i} \}_{i=0\div n} \), volem una formula
\[ I = \int_{a}^{b} f(x) dx \approx \sum_{i=0}^{n} w_{i}f(x_i) \]


*** Formula de trapezi
\[ I = w_{0}f(a) + w_{1}f(b) + E_{1} \] 
on \(w_{0} = w_{1} = \frac{h}{2}, E_{1} = -\frac{h^3}{12}f^{''}(\mu), \mu \in [a,b]. \)

*** Quadratura de Simpson
\[ I = w_{0}f(x_{0}) + w_{1}f(x_{1}) + w_{2}f(x_{2}) + E_2 \]
on \( w_{0} = w_{2} = \frac{1}{3}, w_{1} = \frac{4}{3}, E_2 = - \frac{(b-a)^3}{12m^2}f^{4)}(\mu) , \mu \in [a,b]. \)

* Metodes numerics per EDOs
Una EDO de ordre N te forma \( \frac{d^{n}y}{dx^{n}} = f(x, y, \frac{dy}{dx}, .. , \frac{d^{n-1}y}{dx^{n-1}}, a < x < b \)

